Repository: 4IceG/luci-app-qfirehose
Catalog: luci-app-qfirehose/po/*/qfirehose.po
Languages: pl

source: Qfirehose is a command-line tool for flashing Qualcomm firmware on OpenWrt.
pl: Interfejs użytkownika dla konsolowego narzędzia Qfirehose, umożliwia w OpenWrt wgrywanie firmware do modemów Quectel-a.

source: Version
pl: Wersja

source: Firmware File
pl: Plik firmware

source: Upgrade package directory path
pl: Ścieżka do katalogu z plikiem aktualizacji.

source: Communication Port
pl: Port do komunikacji

source: Diagnose port, will auto-detect if not specified
pl: Wybierz port, jeśli nie został określony będzie wykryty automatycznie.

source: USB Device
pl: Urządzenie USB

source: When multiple modules exist on the board, use -s specify which module you want to upgrade
pl: Jeśli na płycie znajduje się wiele modułów, użyj -s, aby określić, który moduł chcesz uaktualnić.

source: Device Type
pl: Typ urządzenia

source: Device Type, default nand, support emmc/ufs
pl: Typ urządzenia, domyślny NAND, wspiera emmc/ufs

source: NAND (Default)
pl: NAND (domyślny)

source: Skip MD5 Check
pl: Pomiń sprawdzanie MD5

source: Skip MD5 checksum verification
pl: Pomiń weryfikację sumy kontrolnej MD5.

source: Catch USB Monitor Log
pl: Przechwyć dziennik monitora USB

source: Save USB monitor log to file (requires debugfs and usbmon)
pl: Zapisz dziennik monitora USB do pliku (wymaga debugfs i usbmon)

source: Signed Firmware
pl: Podpisane oprogramowanie

source: For AG215S-GLR signed firmware packages
pl: Dla pakietów oprogramowania układowego AG215S-GLR z podpisem

source: Flash Firmware...
pl: Wgraj firmware...

source: Log
pl: Plik dziennika (log)

source: Log file will be saved to /var/log/qfirehose/
pl: Plik dziennika zostanie zapisany w /var/log/qfirehose/

source: Please select a firmware file first.
pl: Najpierw wybierz plik firmware.

source: Firmware upgrade completed successfully.
pl: Firmware zostało pomyślnie wgrane.

source: Failed to flash firmware:
pl: Nie udało się wgrać firmware:

source: Error:
pl: Błąd：

source: Warning
pl: Ostrzeżenie

source: Warning.
pl: Ostrzeżenie.

source: Please ensure before proceeding:
pl: Przed kontynuowaniem upewnij się, że:

source: The firmware you selected is from official channels and compatible with your MODEM.
pl: Wybrane oprogramowanie sprzętowe pochodzi z oficjalnych źródeł i jest kompatybilne z Twoim MODEMEM.

source: The firmware version to be flashed should be higher than the version currently in use.
pl: Wersja firmware, którą należy wgrać, musi być wyższa od wersji aktualnie używanej.

source: Use of software is completely on your own risk.
pl: Korzystasz z oprogramowania na własne ryzyko.

source: Flashing wrong firmware or failed flash can brick your modem permanently.
pl: Zainstalowanie niewłaściwego firmware lub nieudana operacja flashowania może trwale uszkodzić modem.

source: Avoid flashing, if device works without issues and updated firmware does not contain new necessary changes.
pl: Unikaj flashowania, jeśli urządzenie działa bez problemów, a zaktualizowane oprogramowanie nie zawiera nowych, niezbędnych zmian.

source: Do not flash, if you are not willing to take this risk or do not know what you are doing.
pl: Nie wgrywaj firmware, jeśli nie chcesz podjąć takiego ryzyka lub nie jesteś pewien tego co robisz.

source: After succesful flashing, you should use terminal to issue factory reset for modem settings with AT&F command.
pl: Po pomyślnym flashowaniu należy użyć terminala, aby przywrócić ustawienia fabryczne modemu za pomocą polecenia AT&F.

source: mPCIe users (mostly): If modem has completely disappeared after succesful flashing, reason might be that some firmware updates set default mode to USB3 which is unsupported by some mPCIe slots, in this case, you should connect it to USB port using mPCIe -> USB adapter, even most of cheap chinese modules can reveal device. After this you should issue a command to use USB2, which may vary between models, but on most Quectel modems is: AT+QUSBCFG="SS",0
pl: Użytkownicy mPCIe (głównie): Jeśli modem całkowicie zniknął po udanym flashowaniu, przyczyną może być to, że niektóre aktualizacje firmware ustawiają domyślny tryb na USB3, który nie jest obsługiwany przez niektóre gniazda mPCIe, w takim przypadku należy podłączyć modem do portu USB za pomocą adaptera mPCIe -> USB, nawet większość tanich chińskich modułów może pokazać urządzenie. Następnie należy wydać polecenie użycia USB2, które może się różnić w zależności od modelu, ale w przypadku większości modemów Quectel jest to: AT+QUSBCFG="SS",0

source: Cancel
pl: Anuluj

source: Continue
pl: Kontynuuj

source: Flashing Firmware
pl: Wgrywanie firmware

source: Starting firmware flash process...
pl: Rozpoczęcie procesu wgrywania oprogramowania...

source: Firmware package:
pl: Spakowany plik firmware:

source: Cleaning up working directory...
pl: Czyszczenie katalogu roboczego...

source: Creating extraction directory...
pl: Tworzenie katalogu wyodrębniania...

source: Extracting firmware package...
pl: Wyodrębnianie pliku firmware...

source: Starting Qfirehose with command:
pl: Uruchamianie Qfirehose z komendą:

source: For detailed log, please check
pl: Aby uzyskać szczegółowy dziennik, sprawdź

source: Erase All Before Download
pl: Usuń wszystko przed pobraniem

source: Will erase all data including calibration data, please be careful
pl: Usunie wszystkie dane, w tym dane kalibracji, proszę zachować ostrożność.

source: Flashing firmware, please wait...
pl: Trwa wgrywanie firmware, proszę czekać...

source: The firmware upload process has started
pl: Rozpoczęto proces wgrywania firmware
